In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.DataFrame(
    {
        'id':[1,2],
        'store_nbr': [1,2],
        'family': ['POULTRY','PRODUCE']
    }
)

   id  store_nbr   family
0   1          1  POULTRY
1   2          2  PRODUCE

In [11]:
oil = pd.read_csv('retail/oil.csv')

In [14]:
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [20]:
oil.shape

(1218, 2)

In [21]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [22]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [23]:
oil.columns = ['price date','oil price']

In [24]:
oil

      price date  oil price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [25]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['price date', 'oil price'], dtype='object')]

In [26]:
oil.dtypes

price date     object
oil price     float64
dtype: object

In [28]:
oil.head()

   price date  oil price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [29]:
oil.head(6)

   price date  oil price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20
5  2013-01-08      93.21

In [30]:
oil.sample(5)

      price date  oil price
1115  2017-04-11      53.38
778   2015-12-25        NaN
633   2015-06-05      59.11
210   2013-10-22      97.63
108   2013-05-31      91.93

In [31]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price date  1218 non-null   object
 1   oil price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [52]:
oil.describe()

         oil price
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

In [53]:
oil.describe().loc['std','oil price']

25.630475729453224

In [56]:
oil.sample(5, random_state=12345)

      price date  oil price
656   2015-07-08      51.61
502   2014-12-04      66.73
111   2013-06-05      93.66
1134  2017-05-08      46.46
931   2016-07-27      41.90